--------------------------------2014年5月26日 15:58:22 by joychine------------------------
1、版本信息：android:versionCode="65"  android:versionName="3.6.5"
2、修正错误：对于特效，存在定时任务不退出的风险，照成程序卡死…………严重。已经修复。
--------------------------------2014年5月26日 11:10:11 by joychine------------------------
1、版本信息：android:versionCode="65"  android:versionName="3.6.5"
2、修正流程：局域网同步轮播(或者叫局域网同步点播)，预先设置一台机器为主机，发送轮播任务下去，如果某台主机存在预先的设置，那么这台机器就是主机每次
                      切换页面会udp广播局域网其他机器。
--------------------------------2014年5月20日 14:05:35 by joychine------------------------
1、版本信息：android:versionCode="64"  android:versionName="3.6.4"
2、新增功能：局域网同步点播，主机轮播，从机接收到主机给的命令指定播放指定页面。
--------------------------------2014年5月15日 19:23:32 by joychine------------------------
1、版本信息：android:versionCode="64"  android:versionName="3.6.4"
2、完善功能：在GPS同步轮播时，如果启动时已经"过时了"，会马上检测播"不应该过时的"广告程序。下次任务来时才会同步起来。
--------------------------------2014年5月15日 10:22:02 by joychine------------------------
1、版本信息：android:versionCode="63"  android:versionName="3.6.3"
2、新增功能：根据时间的Gps轮播已经基本模拟完成，根据系统时间每秒检测一次的方式。
--------------------------------2014年5月7日 14:33:25 by joychine------------------------
1、版本信息：android:versionCode="62"  android:versionName="3.6.2"
2、修复错误，图片回收在特效师clicpdrawable不能当前bitmapdrawable回收。以判断类型。
--------------------------------2014年4月21日 17:07:56 by joychine------------------------
1、版本信息：android:versionCode="62"  android:versionName="3.6.2"
2、gif3回归边播放便解析，降低cpu，不用缓存，但是播放速度，变慢了。
--------------------------------2014年4月21日 14:23:34 by joychine------------------------
1、版本信息：android:versionCode="60"  android:versionName="3.6.0"
2、gif2图片解码用的是星期五的版本，解析gif是很正常效果也很好，但是cpu使用率高达90%以上。
3、给进程处理加了锁
--------------------------------2014年4月21日 14:23:34 by joychine------------------------
1、版本信息：android:versionCode="61"  android:versionName="3.6.1"
2、gif1图片解码用的是星期六凌晨修正一个错误的版本，解决播放gif可能重叠的问题。缓存都是cache下，但是发现有照成/data可用空间剩余4k的问题
   照成gif播放就会一直黑了，没空间了，但是发现/data/data/com.led.player/cache目录下并没有文件占用。。。
--------------------------------2014年4月19日 18:38:18 by joychine------------------------
1、版本信息：android:versionCode="59"  android:versionName="3.5.9"
2、修正错误：对视频protype是1,2都表示视频的代码修正，以前只判断了2是为视频，照成上位机发过来的rmvb视频给了progtype是1程序死循环cpu占用100%
3、新增功能：支持对gif图片的显示，但是gif帧数越大，cpu占用率越高，会照成系统不稳定，潜在性的死机危险。
4、用户gif3下的gif解析。
--------------------------------2014年4月14日 19:40:52 by Joychine------------------------
1、版本信息：android:versionCode="58"  android:versionName="3.5.8"
2、新增功能：拷贝播放文件时有进度提示，拷贝播放前有空间容量计算提示空间是否足够拷贝。
3、修正bugs：修正原来sdcard容量不足照成升级文件下发生成0KB的大小文件提示"xxx不是有效的升级文件的问题"，错误源头是sdcard容量不足所致；修正升级netclient
            却提示ledplayer不是有效的升级文件问题，原因也是sdcard没有容量了，接到0K。
4、修正错误：更改由来已久的历史遗留问题，比如主线程复制播放时拷贝文件，和serialport反复开进程阻塞程序的潜在风险，
--------------------------------2014年4月9日 09:41:34------------------------
1、版本信息：android:versionCode="57"  android:versionName="3.5.7"
2、对网络发送下去的走马灯控制流程优化，看程序播放时是否还会卡界面不动了。
--------------------------------2014年3月31日 18:04:37------------------------
1、版本信息：android:versionCode="56"  android:versionName="3.5.6"
2、修正错误：修正下位机对png、bmp等小图片显示成一片黑的问题。
--------------------------------2014年3月29日 14:04:00------------------------
1、版本信息：android:versionCode="55"  android:versionName="3.5.5"
2、新增功能：定时开关机、定时亮度调节、定时开关瓶。
--------------------------------2014年3月28日 14:52:38------------------------
1、版本信息：android:versionCode="54"  android:versionName="3.5.4"
2、修正板卡声音太小的问题。。。
--------------------------------2014年3月27日 09:02:41------------------------
1、版本信息：android:versionCode="53"  android:versionName="3.5.3"
2、修正wifi客户端连接问题。
--------------------------------2014年3月20日 17:26:58------------------------
1、版本信息：android:versionCode="49"  android:versionName="3.4.9"
2、优化程序总体设计对进程的创建与取消。。。
--------------------------------2014年3月20日 17:26:58------------------------
1、版本信息：android:versionCode="47"  android:versionName="3.4.7"
2、优化升级时的事物处理，进一步提升升级稳定性对 ：  同个程序同版本短时间内发多次
、同个程序不同版本短时间内发多次、不同程序各自版本
   短时间内发多次。进行了优化处理。
   player收到文件放在 bts目录下。
--------------------------------2014年3月20日 09:03:15------------------------
1、版本信息：android:versionCode="46"  android:versionName="3.4.6"
2、截稿篇：彻底修复找不到卡的错误。
--------------------------------2014年3月18日 15:01:15------------------------
1、版本信息：android:versionCode="45"  android:versionName="3.4.5"
2、再次修正设置ip会代码阻塞的严重问题，等待测试检验。
--------------------------------2014年3月17日 14:20:07------------------------
1、版本信息：android:versionCode="44"  android:versionName="3.4.4"
2、修正走马灯窗口设置背景色无效果的问题，具体在ParseXml.java的983行新增代码textwindow.getTextViewAttr().setBgClr(Color.parseColor("#"+parser.getText()));
--------------------------------2014年3月17日 11:15:50------------------------
1、版本信息：android:versionCode="43"  android:versionName="3.4.3"
2、修正文字少一节问题，按照说明替换了TextSurfaceView.java文件
--------------------------------2014年3月12日 17:34:14------------------------
1、版本信息：android:versionCode="41"    android:versionName="3.4.1"
2、优化网络连接搜素控制连接。 wifi连上路由后，网线直连需要断开wifi连接(要么断开板卡与路由器的连接要么拔掉wifi卡)
3、3G设置好网络配置后，需要重启，当3G模块可以上网时，以太网卡被系统给关闭了。
--------------------------------2014年3月6日 15:41:02-------------------------
1、版本信息：android:versionCode="40"    android:versionName="3.4.0"
2、new functions：①支持对Pockt-LED和pc端btstudio程序发送LEDPlayer.bin和NETClient.bin文件升级
3、optimize：①走字不那么抖动好不好②彻底解决发送空走马灯文本程序异常退出问题				  
--------------------------------2014年2月24日 08:59:44-------------------------
一.当前android:versionCode="31"    android:versionName="3.3.1"
二.只留下simfang.ttf字体。走字好像不会上下跳动。但是 多个字幕时，bug有第二天字幕的速度会跟随第一条字幕，设置了也没效。还有就是最后一条字幕
   播完后会卡顿一下。
三.使用系统默认字体后，内存占用从300M以上降低至10M多，字体也不都抖动了，程序也更稳定了。
----------------------------------------------------------------------------------------------------------------------
2014年2月28日 09:03:18
一.解决了 文件下发后突然断电重启后看到文件不存在了 或 文件大小为0的问题。
